# SQL join 
## Model description
* Module name : sql_join_pd.ipynb
* Purpose     : Create two simple tables to demonstrate inner join and left outer join, 
* Notes       
  * Will use read_sql_query form pandas to get the column name with value from query results
  * The right outer join and full outer join are not currently supported by sqlite

## import package

In [1]:
import sqlite3
import pandas as pd

## Establish database connection and create cursor

In [2]:
# Connect to the database 
conn = sqlite3.connect("myTable.db")
 
# Create a cursor 
dbcur = conn.cursor()

## Create and insert rows into table emp_1

In [3]:
#Drop tables
dbcur.execute("DROP TABLE IF EXISTS emp_1")
# Define a SQL statement to create table emp_1
sql_cmd = """CREATE TABLE IF NOT EXISTS emp_1 ( 
ID INTEGER PRIMARY KEY, 
fname VARCHAR(20), 
lname VARCHAR(30), 
gender CHAR(1), 
joining DATE);"""
 
# Execute the statement
dbcur.execute(sql_cmd)

In [4]:
# Get table attributes
print("Atribute of emp_1 \n {}".format(pd.read_sql_query('PRAGMA table_info(emp_1)', conn)))

Atribute of emp_1
    cid     name         type  notnull dflt_value  pk
0    0       ID      INTEGER        0       None   1
1    1    fname  VARCHAR(20)        0       None   0
2    2    lname  VARCHAR(30)        0       None   0
3    3   gender      CHAR(1)        0       None   0
4    4  joining         DATE        0       None   0

In [5]:
# Insert  rows into emp_1
sql_cmd = """INSERT INTO emp_1 VALUES (23, "Rishabh", "Bansal", "M", "2014-03-28"), 
                                      (1,  "Bill", "Gates", "M", "1980-10-28"),
                                      (24, "Mary", "Gates", "M", "1980-10-28");"""
dbcur.execute(sql_cmd)

In [6]:
# Get count and content from emp_1
print("count of emp_1 \n {} \n".format(pd.read_sql_query("select count(*) from emp_1", conn)))
print("content of emp_1 \n {}".format(pd.read_sql_query("select * from emp_1",conn)))

count of emp_1
    count(*)
0         3

content of emp_1
    ID    fname   lname gender     joining
0   1     Bill   Gates      M  1980-10-28
1  23  Rishabh  Bansal      M  2014-03-28
2  24     Mary   Gates      M  1980-10-28

## Create and insert rows into table emp_2

In [7]:
#Drop tables
dbcur.execute("DROP TABLE IF EXISTS emp_2")

# Define a SQL statement to create table emp_2
sql_cmd = """CREATE TABLE IF NOT EXISTS emp_2 ( 
ID INTEGER PRIMARY KEY, 
job VARCHAR(20) 
);"""
# Execute the statement
dbcur.execute(sql_cmd)

In [8]:
# Get table attributes
print("Atribute of emp_2 \n {}".format(pd.read_sql_query('PRAGMA table_info(emp_2)', conn)))

Atribute of emp_2
    cid name         type  notnull dflt_value  pk
0    0   ID      INTEGER        0       None   1
1    1  job  VARCHAR(20)        0       None   0

In [9]:

# Insert rows into emp_2
sql_cmd = """INSERT INTO emp_2 VALUES (23, "Sales"), (1, "Mgr"), (3,"Mgr")""" 
dbcur.execute(sql_cmd)

In [10]:

# Get count and content
print("Count of emp_2 \n {} \n".format(pd.read_sql_query("select count(*) from emp_2", conn)))
print("content of emp_2 \n {}".format(pd.read_sql_query("select * from emp_2",conn)))

Count of emp_2
    count(*)
0         3

content of emp_2
    ID    job
0   1    Mgr
1   3    Mgr
2  23  Sales

## Inner join

In [11]:
# SQL command for inner join
sql_cmd = """SELECT * FROM  emp_1 INNER JOIN emp_2 ON emp_1.ID = emp_2.ID;"""
print("Use ID to inner join emp_1 and emp_2\n {}".format(pd.read_sql_query(sql_cmd, conn)))

Use ID to inner join emp_1 and emp_2
    ID    fname   lname gender     joining  ID    job
0   1     Bill   Gates      M  1980-10-28   1    Mgr
1  23  Rishabh  Bansal      M  2014-03-28  23  Sales

## left outer join

In [12]:
# SQL command for left outer join
sql_cmd = """SELECT * FROM  emp_1 LEFT OUTER JOIN emp_2 ON emp_1.ID = emp_2.ID;"""
print("Use ID to left outer  join emp_1 and emp_2\n {}".format(pd.read_sql_query(sql_cmd, conn)))

Use ID to left outer  join emp_1 and emp_2
    ID    fname   lname gender     joining    ID    job
0   1     Bill   Gates      M  1980-10-28   1.0    Mgr
1  23  Rishabh  Bansal      M  2014-03-28  23.0  Sales
2  24     Mary   Gates      M  1980-10-28   NaN   None